{"title":"Goodbye Flash, Hello Modern Web 👋","slug":"goodbye-flash-hello-modern-web","html":"<p>As January 2021 begins, gamers around the world paid tribute to Adobe Flash Player as it officially enters its end-of-life. </p>\n<img src=\"thankyouflash.jpeg\" alt=\"Thank you Flash!\"/>\n<figcaption><a href=\"https://www.reddit.com/r/gaming/comments/kniy6c/thank_you/\" target=\"_blank\">\nImage Source</a> </figcaption>\n\n<p><a target=\"_blank\" rel=\"nofollow\" href=\"https://www.gameinformer.com/2018/12/22/how-flash-games-changed-video-game-history\">Game Informer</a> and <a target=\"_blank\" rel=\"nofollow\" href=\"https://www.wired.com/story/flash-games-digital-preservation-flashpoint/\">Wired</a> have great articles on Flash&#39;s legacy, but my favorite is <a href=\"https://www.flashgamehistory.com/\" target=\"_blank\">FlashGameHistory.com</a> by <a href=\"https://twitter.com/JGamesCh\" target=\"_blank\">Jonas Richner</a>, embedded below. </p>\n<iframe src=\"https://www.flashgamehistory.com/\" width=\"100%\" height=\"400px\"></iframe>\n\n<p>As I scroll through the page I fondly remember <strong><em>Canabalt</em></strong> by Adam Saltsman, <strong><em>Rebuild</em></strong> by Sarah Northway, <strong><em>Defender&#39;s Quest</em></strong> by Lars Doucet, and dozens more games... games from amazing developers, boldly creating new game genres that have come to influence the games that we all play today.</p>\n<p>January 1, 2021 marked the end of an era. <strong>The Flash Era.</strong></p>\n<hr>\n<p>As we bid Flash farewell, the game industry is in a very different place.</p>\n<p>As Jonas Richner puts it, the Flash Era was one of <strong>Creative Chaos</strong> 🤯. </p>\n<p>Nowadays, it&#39;s mostly an <strong>Ordered Process</strong> 📋.</p>\n<hr>\n<p>Game developers now have game design down to a science.\nIf you&#39;ve been making games for a living for the past few years, you would have read about industry standard game design terms such as \n<a target=\"_blank\" rel=\"nofollow\" href=\"https://medium.com/alto-io/on-virtual-swords-core-loops-and-the-decentralized-cryptoitem-economy-7a5f3b711208\">Core Loops</a>.</p>\n<p>Here are some example core loops from <a href=\"https://www.deconstructoroffun.com/\" target=\"_blank\">Deconstructor of Fun</a> for <a href=\"https://www.deconstructoroffun.com/blog/2017/9/29/why-capcoms-puzzle-fighter-fails-to-make-a-match\" target=\"_blank\">\nPuzzle Fighter</a>:</p>\n<img src=\"exampleloops1.png\" alt=\"Game Loops 1\"/>\n\n<p>One of <a target=\"_blank\" rel=\"nofollow\" href=\"https://medium.com/game-design-inspirations/fire-emblem-heroes-sacred-coin-and-the-value-of-player-trust-23d7a9545b48\">my favorite mobile games</a>, <a href=\"https://www.deconstructoroffun.com/blog/2017/6/20/fire-emblem-heroes-its-gacha-a-hand-on-your-wallet\" target=\"_blank\">\nFire Emblem Heroes</a>:\n<img src=\"exampleloops2.png\" alt=\"Game Loops 2\"/></p>\n<p>and <a target=\"_blank\" rel=\"nofollow\" href=\"https://knowyourmeme.com/memes/thelegend27\">TheLegend27</a>&#39;s favorite game, <a href=\"https://www.deconstructoroffun.com/blog/2017/7/21/4x-games-the-secrets-of-machine-zones-success-zpm56\" target=\"_blank\">\nGame of War</a>.\n<img src=\"exampleloops3.png\" alt=\"Game Loops 3\"/></p>\n<p>While these games are mechanically different, they all follow the same playbook: </p>\n<img src=\"coreloop.png\" alt=\"Core Loop\"/>\n\n<p>Get players accustomed to performing resource-consuming activities as long as possible <strong>(retention)</strong>, and get value from them by triggering a scarcity of those resources <strong>(monetization)</strong>.</p>\n<p>Does it work? Well, once again, games made more than a hundred billion dollars in revenue last year, with outstanding <a target=\"_blank\" rel=\"nofollow\" href=\"https://www.pocketgamer.biz/news/75450/digital-games-spending-hit-1266-billion-in-2020/\">12% year-on-year growth</a>.</p>\n<p>And yet again, <a target=\"_blank\" rel=\"nofollow\" href=\"https://medium.com/@polats/3-disruptive-game-design-trends-to-look-forward-to-in-2020-23c22aa4b6be\">it&#39;s the same top games that we see on the list</a>. Gardenscapes, Pokemon Go, Candy Crush-- all games that have been there for more than 5 years.</p>\n<p>It may not be <strong>Creative Chaos</strong>, but hey, it works very, VERY well.</p>\n<hr>\n<p>Looking back at Flash&#39;s timeline and seeing the slower trickle of games as it nears its end-of-life, it saddens me that we might have lost the spark of innovation that it has started.</p>\n<video controls loop width=\"100%\">\n <source src=\"https://www.flashgamehistory.com/video/FlashGames.mp4\n\" type=\"video/mp4\">\n</video>\n\n<p>But as I read through Jonas Richner&#39;s heartfelt tribute and the testimonials of all these developers that I look up to; I realize that while Flash may be gone, its spirit of innovation continues on-- in HTML5 game developers and open-source web developers, collectively called the Modern Web.</p>\n<p>A perfect example is the impressive <a target=\"_blank\" rel=\"nofollow\" href=\"https://shapez.io\">Shapez.io</a> by <a target=\"_blank\" rel=\"nofollow\" href=\"https://tobspr.com/\">Tobias Springer</a>: A <a target=\"_blank\" rel=\"nofollow\" href=\"https://github.com/tobspr/shapez.io\">fully-open source</a> factory building game made in Javascript. It even has a native version with an <a target=\"_blank\" rel=\"nofollow\" href=\"https://store.steampowered.com/app/1318690/shapezio/\">Overwhelmingly Positive rating on Steam</a>.</p>\n<img src=\"https://cdn.cloudflare.steamstatic.com/steam/apps/1318690/extras/store_page_gif.gif\" alt=\"Shapez.io\">\n\n<p>We have <a target=\"_blank\" rel=\"nofollow\" href=\"https://toughlovearena.com/\">Tough Love Arena</a> by M. Paul Weeks and Amy Xu, a web-based fighting game that has better netcode and replay function than even some of the bigger fighting games out there. </p>\n<img src=\"toughlovearena.png\" alt=\"Tough Love Arena\"/>\n\n<p>And we have impressive game-like experiences that push web technology even further than Flash did, with WebVR + Mobile experiments like <a target=\"_blank\" rel=\"nofollow\" href=\"http://accessmars.withgoogle.com/\">Access Mars</a> by Google and NASA.</p>\n<img src=\"accessmars.png\" alt=\"Access Mars\"/>\n\n<p>These games show us that the Modern Web is ready to take on the mantle and carry on Flash&#39;s legacy-- </p>\n<p>at least technically. </p>\n<p>To fully do so, it has to inherit Flash&#39;s superpowers. </p>\n<h2 id=\"what-were-flashs-superpowers\">What were Flash&#39;s Superpowers?</h2>\n<p>Luckily, Jonas Richner has listed down each of them for us! The 3 superpowers that the Modern Web has to inherit Mega Man-style are:</p>\n<h3 id=\"1-decentralization\">1. <strong>Decentralization</strong></h3>\n<p>Through the years, the game industry has shifted away from the web and centralized more and more around app stores and social networks. In <a target=\"_blank\" rel=\"nofollow\" href=\"https://medium.com/thrive-global/its-time-to-redesign-the-attention-economy-f9215a2210be\">today&#39;s attention economy</a>, these platforms became the arbiters of success.</p>\n<p>Consequently, game developers were incentivized to focus less on innovating and more on the platforms&#39; two most important metrics: <strong>discoverability</strong> and <strong>in-app monetization</strong>.</p>\n<p>The Modern Web needs to shake up these incentives. </p>\n<p>There are some promising attempts: On discoverability we have new standards such as <a target=\"_blank\" rel=\"nofollow\" href=\"https://github.com/tcmg/open-mini-games\">Tom Greenaway&#39;s Open Mini Games</a> format, while on monetization we have the <a target=\"_blank\" rel=\"nofollow\" href=\"https://webmonetization.org/\">Web Monetization</a> standard. We also have new options like <a target=\"_blank\" rel=\"nofollow\" href=\"https://developer.mozilla.org/en-US/docs/Web/Progressive_web_apps/Offline_Service_workers\">PWAs and Service Workers</a> that can allow games to be deployed like a native app outside of the app stores.</p>\n<p>There is still much to do though, and those looking to fix the discoverability problem can learn a lot from <a target=\"_blank\" rel=\"nofollow\" href=\"https://gamediscoverability.substack.com/\">Simon Carless&#39; GameDiscoverCo newsletter</a>.</p>\n<h3 id=\"2-the-flash-workflow\">2. <strong>&quot;The Flash Workflow&quot;</strong></h3>\n<p>While making games today is easier than ever before, developers bemoan that we&#39;ve lost &quot;The Flash Workflow&quot;.</p>\n<p>Tom Fulp of <strong><em>Newgrounds</em></strong> said:</p>\n<blockquote>\n<p>&quot;Flash was the first program that merged art and code in a way that I always hoped could be possible.&quot;</p>\n</blockquote>\n<p>From Brad Borne of <strong><em>The Fancy Pants Adventures</em></strong> : </p>\n<blockquote>\n<p>&quot;For someone who made videos, stop motion animations, built contraptions, and generally felt the urge to just making something, Flash just felt like exactly what I needed.&quot;</p>\n</blockquote>\n<p>Oliver Joyce of <strong><em>Swords and Sandals</em></strong> continues with:</p>\n<blockquote>\n<p>&quot;...even now, HTML5 gaming struggles to hold a candle to what Flash could do a decade ago&quot;</p>\n</blockquote>\n<p>And this sentiment is echoed throughout the FlashGameHistory.com testimonials.</p>\n<p>I believe it&#39;s not so much the developer experience, which has gotten progressively better with no-code tools and mature engines like Unity and Unreal. </p>\n<p><strong>It&#39;s more that us developers aren&#39;t making games for ourselves anymore.</strong> </p>\n<p><strong>Instead, we&#39;re making them the way they need to be in order to succeed in the app stores.</strong></p>\n<p>I am reminded of Bret Victor&#39;s talk, <a target=\"_blank\" rel=\"nofollow\" href=\"https://jamesclear.com/great-speeches/inventing-on-principle-by-bret-victor\">Inventing on Principle</a>: </p>\n<iframe title=\"vimeo-player\" src=\"https://player.vimeo.com/video/36579366\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen></iframe>\n\n<p>The whole video is a must-watch, but one quote stood out to me as a poignant reminder on what the Modern Web needs to provide game developers:</p>\n<blockquote>\n<p>Creators need an immediate connection to what they&#39;re creating.</p>\n</blockquote>\n<p>The &quot;Flash Workflow&quot; allowed brilliant creators to be closer to the work.  </p>\n<p>In our quest to integrate analytics, ads, and in-app SDKs, we&#39;ve lost that connection.</p>\n<h3 id=\"3-rapid-iteration\">3. Rapid Iteration</h3>\n<p>Lastly, the Modern Web needs to inherit Flash&#39;s capability of getting out of the way of developers, allowing them to realize their visions as easily and quickly as possible.</p>\n<p>This at least is something the Modern Web has consistently pushed the envelope in. The Modern Web moves very fast, largely due to the open-source ethos.</p>\n<p>I am reminded of a quote in Eric S. Raymond&#39;s seminal essay <a target=\"_blank\" rel=\"nofollow\" href=\"http://www.catb.org/esr/writings/cathedral-bazaar/cathedral-bazaar/\">The Cathedral and the Bazaar</a>:</p>\n<blockquote>\n<p>It may well turn out that one of the most important effects of open source&#39;s success will be to teach us that play is the most economically efficient mode of creative work.</p>\n</blockquote>\n<p>The past few years have given us game engines like Phaser and Babylon, multiplayer server technology like Nakama and Colyseus, component frameworks like React and Svelte. </p>\n<p>All these technologies are being used to create the future of web games, free and open-source, and will someday form the backbone of Flash&#39;s eventual successor.</p>\n<hr>\n<p>With Flash&#39;s light dimming as the new year starts, it at least give us clarity on what its successor needs to do to carry the torch.</p>\n<p>The Internet has changed from when Flash first appeared 20 years ago. </p>\n<p>It&#39;s a much noisier place. </p>\n<p>The incentives for making content such as games have changed. </p>\n<p>Players&#39; behaviors have changed. </p>\n<p>Flash reminds us of a different time, when creators were closer to their creations, when their motives and incentives were less complicated. It was a time of great innovation, and, for a lot of the Flash developers, a time of more meaningful connections.</p>\n<p>As new technologies like decentralized storage, decentralized identity, zero-knowledge proofs, and cryptocurrencies appear, we are again empowered to rewrite our core loops.</p>\n<p>We need the Modern Web to coalesce now around what Flash used to stand for-- a platform for creative chaos. We have to look back at that time when games were made for fun, and break the incentive and game loops that we&#39;re all used to running.</p>\n","date":"2021-01-09T08:38:00.000Z","excerpt":"\r\nGamers around the world pay tribute to Adobe Flash Player as it officially enters its end-of-life. Flash's 20-year journey has spawned game genres that have defined the games we're playing right now. Now the Modern Web must be able to carry the torch.\r\n\r\n","printDate":"January 9, 2021","printReadingTime":"7 min read","image":"thankyouflash.jpeg"}